In [4]:
import pandas as pd
import glob

In [5]:
# Get all of the names of our csvs (os)

# Iterate through .csv files 

# read each csv into pandas df

# add county column

# either store df or concatenate to some output df

In [2]:
# W/ all data add oil price , unemployment cols

In [10]:
csv= glob.glob("*_County.csv")
csv

['Guadalupe_County.csv',
 'Comal_County.csv',
 'Austin_County.csv',
 'Tarrant_County.csv',
 'Bexar_County.csv',
 'Hays_County.csv',
 'Dallas_County.csv',
 'Ellis_County.csv',
 'Travis_County.csv',
 'Fayette_County.csv',
 'Lampasas_County.csv',
 'Smith_County.csv',
 'Ector_County.csv',
 'Bell_County.csv',
 'Lubbock_County.csv',
 'Lamar_County.csv',
 'Willacy_County.csv',
 'Nueces_County.csv',
 'Midland_County.csv',
 'Randall_County.csv',
 'Kaufman_County.csv',
 'Brazos_County.csv',
 'Anderson_County.csv',
 'Taylor_County.csv',
 'Wichita_County.csv',
 'Harris_County.csv',
 'Denton_County.csv',
 'McLennan_County.csv',
 'El_Paso_County.csv',
 'Gonzales_County.csv',
 'Kerr_County.csv',
 'Angelina_County.csv',
 'Victoria_County.csv',
 'Rockwall_County.csv',
 'Jefferson_County.csv',
 'Williamson_County.csv',
 'Galveston_County.csv',
 'Tom_Green_County.csv',
 'Colorado_County.csv',
 'Cameron_County.csv',
 'Nacogdoches_County.csv',
 'Montgomery_County.csv',
 'Johnson_County.csv',
 'Brazoria_County.csv',
 'Parker_County.csv',
 'Fort_Bend_County.csv',
 'Coryell_County.csv']

In [17]:
one=csv[0][:-11]
one

'Guadalupe'

In [19]:
read1= pd.read_csv(csv[0])
read1["County"]=csv[0][:-11]
read2= pd.read_csv(csv[1])
read2["County"]=csv[1][:-11]
read3= pd.concat([read1,read2])
read3.head()

,Date,Sales,Dollar Volume,Average Price,Median Price,Total Listings,Months Invntory,County
0,Jan 2011,70,"11,926,588","170,380","168,052",NaN,NaN,Guadalupe
1,Feb 2011,88,"13,808,445","156,914","150,000",NaN,NaN,Guadalupe
2,Mar 2011,131,"20,943,149","159,871","157,000",NaN,NaN,Guadalupe
3,Apr 2011,133,"21,632,252","162,649","156,990",NaN,NaN,Guadalupe
4,May 2011,159,"26,333,193","165,618","156,000",NaN,NaN,Guadalupe

In [35]:
complete_df = read1
for county in csv[0:]:
    new_df= pd.read_csv(county)
    new_df["County"]=county[:-11]
    
    complete_df = pd.concat([complete_df, new_df])

In [36]:
complete_df.shape

(4557, 8)

In [37]:
len(complete_df.County.unique())

47

In [40]:
complete_df.head()

,Date,Sales,Dollar Volume,Average Price,Median Price,Total Listings,Months Invntory,County
0,Jan 2011,37,"4,118,050","111,299","104,900",NaN,NaN,Coryell
1,Feb 2011,36,"4,036,494","112,125","101,000",NaN,NaN,Coryell
2,Mar 2011,42,"4,981,492","118,607","110,000",NaN,NaN,Coryell
3,Apr 2011,51,"5,327,034","104,452","97,500",NaN,NaN,Coryell
4,May 2011,33,"3,524,499","106,803","92,500",NaN,NaN,Coryell

In [99]:
complete_df.reset_index(inplace=True, drop= True)
complete_df.head()

,level_0,index,Date,Sales,Dollar Volume,Average Price,Median Price,Total Listings,Months Invntory,County,unemployment
0,0,0,Jan 2011,37,"4,118,050","111,299","104,900",NaN,NaN,Coryell,8.0
1,1,1,Feb 2011,36,"4,036,494","112,125","101,000",NaN,NaN,Coryell,7.9
2,2,2,Mar 2011,42,"4,981,492","118,607","110,000",NaN,NaN,Coryell,7.9
3,3,3,Apr 2011,51,"5,327,034","104,452","97,500",NaN,NaN,Coryell,7.9
4,4,4,May 2011,33,"3,524,499","106,803","92,500",NaN,NaN,Coryell,7.9

In [70]:
complete_df.to_csv("Complete_house_pricing_data.csv")

In [71]:
unemployment= pd.read_excel("TX-Unemployment data_BLS.xlsx",skiprows=10)
unemployment.head()

   Year  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  2008  4.3  4.3  4.3  4.4  4.5  4.6  4.8  4.9  5.1  5.3  5.6  5.8
1  2009  6.1  6.3  6.5  6.6  7.6  8.0  8.2  8.3  8.3  8.3  8.3  8.3
2  2010  8.3  8.3  8.3  8.2  8.1  8.0  8.0  8.0  8.1  8.1  8.1  8.1
3  2011  8.0  7.9  7.9  7.9  7.9  7.9  7.9  7.8  7.7  7.6  7.4  7.2
4  2012  7.1  7.0  6.9  6.9  6.9  6.8  6.7  6.6  6.5  6.5  6.5  6.5

In [72]:
unemployment.loc[unemployment['Year']==2011,'Jan'].values[0]

8.0

In [73]:
un= unemployment.set_index("Year")
un

      Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
Year
2008  4.3  4.3  4.3  4.4  4.5  4.6  4.8  4.9  5.1  5.3  5.6  5.8
2009  6.1  6.3  6.5  6.6  7.6  8.0  8.2  8.3  8.3  8.3  8.3  8.3
2010  8.3  8.3  8.3  8.2  8.1  8.0  8.0  8.0  8.1  8.1  8.1  8.1
2011  8.0  7.9  7.9  7.9  7.9  7.9  7.9  7.8  7.7  7.6  7.4  7.2
2012  7.1  7.0  6.9  6.9  6.9  6.8  6.7  6.6  6.5  6.5  6.5  6.5
2013  6.5  6.5  6.5  6.5  6.4  6.3  6.3  6.2  6.1  6.0  5.9  5.8
2014  5.7  5.5  5.4  5.3  5.2  5.1  5.1  5.0  4.9  4.8  4.7  4.6
2015  4.5  4.4  4.4  4.4  4.4  4.4  4.4  4.4  4.4  4.4  4.5  4.5
2016  4.5  4.5  4.5  4.5  4.6  4.6  4.7  4.7  4.7  4.8  4.8  4.8
2017  4.8  4.7  4.6  4.5  4.4  4.2  4.1  4.0  4.0  3.9  3.9  4.0
2018  4.0  4.0  4.0  4.1  4.1  4.0  4.0  3.9  3.8  3.7  3.7  NaN

In [74]:
un.loc[2008,"Dec"]

5.8

In [75]:
one = complete_df.loc[0,'Date']
one

'Jan 2011'

In [84]:
month, year = one.split(' ')
year = int(year)
print(month, year)

Jan 2011

In [88]:
un.loc[year,month]
un.loc[2011, 'Jan']

8.0

In [91]:
date = one
month, year = date.split(' ')

In [92]:
def reference_cell(date):
    # split date into month, year
    month, year= date.split(" ")
    
    #convert year to int
    year= int(year)
#     reference cell in position year, month
    un_value= un.loc[year, month]
    # Return output
    return un_value

In [94]:
reference_cell("Jan 2011")

8.0

In [96]:
complete_df["unemployment"]=complete_df['Date'].apply(reference_cell)

In [100]:
complete_df.head()

,level_0,index,Date,Sales,Dollar Volume,Average Price,Median Price,Total Listings,Months Invntory,County,unemployment
0,0,0,Jan 2011,37,"4,118,050","111,299","104,900",NaN,NaN,Coryell,8.0
1,1,1,Feb 2011,36,"4,036,494","112,125","101,000",NaN,NaN,Coryell,7.9
2,2,2,Mar 2011,42,"4,981,492","118,607","110,000",NaN,NaN,Coryell,7.9
3,3,3,Apr 2011,51,"5,327,034","104,452","97,500",NaN,NaN,Coryell,7.9
4,4,4,May 2011,33,"3,524,499","106,803","92,500",NaN,NaN,Coryell,7.9

In [101]:
complete_df['unemployment'] = complete_df['Date'].apply(lambda x: un.loc[int(x.split()[1]), x.split()[0]])
complete_df.head()

,level_0,index,Date,Sales,Dollar Volume,Average Price,Median Price,Total Listings,Months Invntory,County,unemployment
0,0,0,Jan 2011,37,"4,118,050","111,299","104,900",NaN,NaN,Coryell,8.0
1,1,1,Feb 2011,36,"4,036,494","112,125","101,000",NaN,NaN,Coryell,7.9
2,2,2,Mar 2011,42,"4,981,492","118,607","110,000",NaN,NaN,Coryell,7.9
3,3,3,Apr 2011,51,"5,327,034","104,452","97,500",NaN,NaN,Coryell,7.9
4,4,4,May 2011,33,"3,524,499","106,803","92,500",NaN,NaN,Coryell,7.9

In [98]:
complete_df.to_csv("Complete_house_pricing_data.csv")